#######################################################################################
# <説明>
# ローカルディレクトリをAmazon S3へAWS CLIコマンドを使用し、再帰的アップロードを行う
# 
# <更新日>
# 作成日：20210710
# 最終更新日：20210919
#
# <使用時における注意事項>
# ・本スクリプトの文字コードは「ANSI(SJIS)」を指定すること
# ・-
#
# <コメント>
# ・-
# ・-
#
#######################################################################################

#######################################################################################
# 事前設定
#######################################################################################

# 今月の月（yyyyM）を取得
$str_month = Get-Date -Format "yyyyM"

# 現在の時刻（yyyyMMddhhmmss）を取得
$str_date = Get-Date -Format "yyyyMMddhhmmss"

# 現在の時刻（yyyyMMdd - hhmmss）を取得
$str_time = Get-Date -Format "yyyy-MM-dd hh:mm:ss"

# スクリプトの設置ディレクトリを取得
$CurrentDir = Split-Path $MyInvocation.MyCommand.Path


#######################################################################################
# パラメータ設定
#######################################################################################

# バックアップ対象ディレクトリ（ターゲット）
$backup_target = '<バックアップ対象ディレクトリのパスを指定>'

# 実行ログの出力先
$output_log = "<実行ログの出力先パスを指定>"

# S3バケットのURI
$s3bucket = "<アップロード先S3_URIを指定>"

# AWS CLI プロファイル生成
$Env:AWS_ACCESS_KEY_ID="<アクセスキーID>"
$Env:AWS_SECRET_ACCESS_KEY="<シークレットキーID>"
$Env:AWS_DEFAULT_REGION="<リージョン名>"


#######################################################################################
# 関数：指定するディレクトリが存在するか確認する 
#######################################################################################

function function_target_check{

    # 指定したディレクトリが存在するかを確認
    $target_check = (Test-Path $backup_target)

    # 存在有無によって処理を変える
    if($target_check){
        # 処理を続ける
    }else{
        Write-Host "指定したバックアップ元ディレクトリのパスが存在しません"
        Exit
    }

}


#######################################################################################
## 実行前処理
#######################################################################################

# ログ見出し出力（Start）
Write-Output "************** Local_Directory_Backup_to_Amazon_S3 $str_time Start **************" | Out-File -Append -Encoding default $output_log


#######################################################################################
# アップロード用ZIPディレクトリを生成
#######################################################################################

# バックアップ対象ディレクトリが存在するか確認 ⇒ 存在しなければスクリプト処理を停止
function_target_check

# バックアップ対象ディレクトリをZIP圧縮
Compress-Archive -Path $backup_target -DestinationPath $CurrentDir\$str_date.zip
$target_zip = "$CurrentDir\$str_date.zip"


#######################################################################################
# ローカルディレクトリをAmazon S3へアップロードする
#######################################################################################

# ローカルディレクトリをAmazon S3へコピーする。 >> 今日の日付のログファイルを作成し、実行ログをログファイルに出力する。
aws s3 cp $target_zip $s3bucket | Out-File -Append -Encoding default $output_log


#######################################################################################
# 実行後処理
#######################################################################################

# 一時ディレクトリを削除
Remove-Item $target_zip -recurse

# ログ見出し出力（End）
Write-Output "**************  Local_Directory_Backup_to_Amazon_S3 $str_time End  **************" | Out-File -Append -Encoding default $output_log
